
[
  {
      "arabic": "إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ",
      "translation": "Actions are judged by intentions.",
      "reference": "Sahih al-Bukhari 1"
    },
    {
      "arabic": "عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اللَّهِ ﷺ: مَنْ نَفَّسَ عَنْ مُؤْمِنٍ كُرْبَةً مِنْ كُرَبِ الدُّنْيَا نَفَّسَ اللَّهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ، وَمَنْ يَسَّرَ عَلَى مُعْسِرٍ يَسَّرَ اللَّهُ عَلَيْهِ فِي الدُّنْيَا وَالْآخِرَةِ، وَمَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ فِي الدُّنْيَا وَالْآخِرَةِ، وَاللَّهُ فِي عَوْنِ الْعَبْدِ مَا كَانَ الْعَبْدُ فِي عَوْنِ أَخِيهِ.",
      "translation": "The Messenger of Allah ﷺ said: Whoever relieves a believer from a hardship of this world, Allah will relieve him from a hardship of the Day of Judgment. Whoever eases the difficulty of someone in debt, Allah will ease his difficulties in this world and the Hereafter. Whoever conceals the faults of a Muslim, Allah will conceal his faults in this world and the Hereafter. Allah helps His servant as long as the servant helps his brother.",
      "reference": "Sahih Muslim 2699"
    },
    {
      "arabic": "عَنْ النُّعْمَانِ بْنِ بَشِيرٍ رضي الله عنه قَالَ: قَالَ رَسُولُ اللَّهِ ﷺ: مَثَلُ الْمُؤْمِنِينَ فِي تَوَادِّهِمْ، وَتَرَاحُمِهِمْ، وَتَعَاطُفِهِمْ، مَثَلُ الْجَسَدِ، إِذَا اشْتَكَى مِنْهُ عُضْوٌ، تَدَاعَى لَهُ سَائِرُ الْجَسَدِ بِالسَّهَرِ وَالْحُمَّى.",
      "translation": "The Prophet ﷺ said: The example of the believers in their affection, mercy, and compassion for each other is that of a body. When any limb aches, the whole body reacts with sleeplessness and fever.",
      "reference": "Sahih al-Bukhari 6011, Sahih Muslim 2586"
    },
    {
      "arabic": "عَنْ أَبِي ذَرٍّ رضي الله عنه قَالَ: قَالَ لِي النَّبِيُّ ﷺ: لَا تَحْقِرَنَّ مِنَ الْمَعْرُوفِ شَيْئًا، وَلَوْ أَنْ تَلْقَى أَخَاكَ بِوَجْهٍ طَلْقٍ.",
      "translation": "The Prophet ﷺ said: Do not belittle any good deed, even meeting your brother with a cheerful face.",
      "reference": "Sahih Muslim 2626"
    },
    {
      "arabic": "عَنْ ابْنِ عُمَرَ رضي الله عنه قَالَ: قَالَ رَسُولُ اللَّهِ ﷺ: الْمُسْلِمُ أَخُو الْمُسْلِمِ، لَا يَظْلِمُهُ وَلَا يُسْلِمُهُ، وَمَنْ كَانَ فِي حَاجَةِ أَخِيهِ كَانَ اللَّهُ فِي حَاجَتِهِ، وَمَنْ فَرَّجَ عَنْ مُسْلِمٍ كُرْبَةً فَرَّجَ اللَّهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ، وَمَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ يَوْمَ الْقِيَامَةِ.",
      "translation": "The Prophet ﷺ said: A Muslim is a brother to another Muslim; he should not oppress him nor hand him over to an oppressor. Whoever fulfills the needs of his brother, Allah will fulfill his needs. Whoever relieves a Muslim from hardship, Allah will relieve him from a hardship on the Day of Judgment. Whoever conceals the faults of a Muslim, Allah will conceal his faults on the Day of Judgment.",
      "reference": "Sahih al-Bukhari 2442, Sahih Muslim 2580"
    },
    {
      "arabic": "عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اللَّهِ ﷺ: إِذَا مَاتَ الْإِنْسَانُ انْقَطَعَ عَنْهُ عَمَلُهُ إِلَّا مِنْ ثَلَاثَةٍ: صَدَقَةٍ جَارِيَةٍ، أَوْ عِلْمٍ يُنْتَفَعُ بِهِ، أَوْ وَلَدٍ صَالِحٍ يَدْعُو لَهُ.",
      "translation": "The Prophet ﷺ said: When a person dies, his deeds come to an end except for three: ongoing charity, beneficial knowledge, or a righteous child who prays for him.",
      "reference": "Sahih Muslim 1631"
    },
    {
      "arabic": "عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ رضي الله عنه قَالَ: قَالَ رَسُولُ اللَّهِ ﷺ: نِعْمَتَانِ مَغْبُونٌ فِيهِمَا كَثِيرٌ مِنَ النَّاسِ: الصِّحَّةُ وَالْفَرَاغُ.",
      "translation": "The Messenger of Allah ﷺ said: There are two blessings which many people lose: health and free time.",
      "reference": "Sahih al-Bukhari 6412"
    },
    {
      "arabic": "عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: قِيلَ: يَا رَسُولَ اللَّهِ، أَيُّ النَّاسِ أَكْثَرُ حَقًّا بِحُسْنِ صَحَابَتِي؟ قَالَ: أُمُّكَ. قِيلَ: ثُمَّ مَنْ؟ قَالَ: أُمُّكَ. قِيلَ: ثُمَّ مَنْ؟ قَالَ: أُمُّكَ. قِيلَ: ثُمَّ مَنْ؟ قَالَ: أَبُوكَ.",
      "translation": "A man asked the Messenger of Allah ﷺ: Who among the people is most deserving of my good companionship? He replied: Your mother. The man asked: Then who? He replied: Your mother. He asked again: Then who? He replied: Your mother. He asked once more: Then who? He replied: Your father.",
      "reference": "Sahih al-Bukhari 5971, Sahih Muslim 2548"
    },
    {
      "arabic": "عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اللَّهِ ﷺ: إِنَّ اللَّهَ لَا يَنْظُرُ إِلَى صُوَرِكُمْ وَأَمْوَالِكُمْ، وَلَكِنْ يَنْظُرُ إِلَى قُلُوبِكُمْ وَأَعْمَالِكُمْ.",
      "translation": "The Messenger of Allah ﷺ said: Allah does not look at your appearance or wealth, but He looks at your hearts and your deeds.",
      "reference": "Sahih Muslim 2564"
    },
    {
      "arabic": "عَنْ أَنَسِ بْنِ مَالِكٍ رضي الله عنه قَالَ: قَالَ رَسُولُ اللَّهِ ﷺ: لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ.",
      "translation": "The Prophet ﷺ said: None of you truly believes until he loves for his brother what he loves for himself.",
      "reference": "Sahih al-Bukhari 13, Sahih Muslim 45"
    }
]
    
